notes/AVL_Notes_Sources.org
#+AUTHOR: Jeffrey Young
#+TITLE: AVL Notes and Sources
#+DATE: Feb 23, 2017

# Fix the margins
#+LATEX_HEADER: \usepackage[margin=1in]{geometry}
#+LATEX_HEADER: \usepackage{amssymb}

# Remove section numbers, no table of contents
#+OPTIONS: toc:nil
#+options: num:nil

# Set the article class
#+LaTeX_CLASS: article
#+LaTeX_CLASS_OPTIONS: [10pt, letterpaper]

* Sources
  - AVT001 :: www.cs.fsu.edu/~asriniva/courses/DS13/lectures/Lec17-19.ppt
  - AVT002 :: www.cs.ust.hk/~huamin/COMP171/avl-tree.ppt
  - AVT003 :: https://www.cs.sjsu.edu/~lee/cs146/Asami-avl-presentation.ppt
  - AVT004 :: www.cse.unt.edu/~huangyan/3110/Lectures/SearchTrees.ppt
  - AVT005 :: www.cs.utoronto.ca/~tabrown/csc263/week3.ppt
  - AVT006 :: courses.washington.edu/tcss342/slides/AVLheightproof08.ppt
  - AVT007 :: www.cs.cmu.edu/~ab/15-121F10/.../Lecture%2016%20-%20Balanced%20Trees.ppt
  - AVT008 :: https://www.cs.purdue.edu/homes/ayg/CS251/slides/chap7b.pdf
  - AVT009 :: http://courses.cs.vt.edu/cs2604/spring04/Notes/C06.AVLTrees.pdf
