notes/AVL_Notes_Sources.tex
% Created 2017-03-04 Sat 12:39
% Intended LaTeX compiler: pdflatex
\documentclass[10pt, letterpaper]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\usepackage{amssymb}
\author{Jeffrey Young}
\date{Feb 23, 2017}
\title{AVL Notes and Sources}
\hypersetup{
 pdfauthor={Jeffrey Young},
 pdftitle={AVL Notes and Sources},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.0.50 (Org mode 9.0.5)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section*{Sources}
\label{sec:org5cd4c8d}
\begin{description}
\item[{AVT001}] www.cs.fsu.edu/\textasciitilde{}asriniva/courses/DS13/lectures/Lec17-19.ppt
\item[{AVT002}] www.cs.ust.hk/\textasciitilde{}huamin/COMP171/avl-tree.ppt
\item[{AVT003}] \url{https://www.cs.sjsu.edu/\~lee/cs146/Asami-avl-presentation.ppt}
\item[{AVT004}] www.cse.unt.edu/\textasciitilde{}huangyan/3110/Lectures/SearchTrees.ppt
\item[{AVT005}] www.cs.utoronto.ca/\textasciitilde{}tabrown/csc263/week3.ppt
\item[{AVT006}] courses.washington.edu/tcss342/slides/AVLheightproof08.ppt
\item[{AVT007}] www.cs.cmu.edu/\textasciitilde{}ab/15-121F10/\ldots{}/Lecture\%2016\%20-\%20Balanced\%20Trees.ppt
\item[{AVT008}] \url{https://www.cs.cmu.edu/\~fp/courses/15122-s11/lectures/18-avl.pdf}
\item[{AVT009}] \url{https://www.cs.purdue.edu/homes/ayg/CS251/slides/chap7b.pdf}
\item[{AVT010}] \url{http://courses.cs.vt.edu/cs2604/spring04/Notes/C06.AVLTrees.pdf}
\end{description}
\end{document}
